# Shell & Terminal
brew "zsh"
brew "tmux"
brew "mosh"
brew "chezmoi"
brew "starship"
cask "ghostty"

# Editor
brew "vim"
brew "neovim"
cask "visual-studio-code"
cask "sublime-text"

# Neovim dependencies
brew "ripgrep"
brew "fd"
brew "lazygit"

# Git
brew "git"
brew "gh"
brew "ghq"
brew "pre-commit"
cask "fork"

# Languages & Runtimes
brew "mise"
brew "rust"
brew "uv"
brew "yarn"

# Infrastructure
brew "awscli"
brew "saml2aws"
cask "google-cloud-sdk"
cask "tailscale-app"

# Docker
cask "docker-desktop"

# Database
brew "mysql"

# CLI Tools
brew "bat"
brew "direnv"
brew "fzf"
brew "wget"
brew "mas"

# Security
cask "1password"
cask "1password-cli"

# Applications
cask "appcleaner"
cask "deepl"
cask "google-chrome"
cask "raycast"

# Android
cask "android-studio"
cask "android-commandlinetools"
