# Shell & Terminal
brew "zsh"
brew "tmux"
brew "chezmoi"
cask "ghostty"

# Editor
brew "vim"
cask "cursor"
cask "visual-studio-code"
cask "sublime-text"

# Git
brew "git"
brew "gh"
brew "ghq"
brew "gibo"
brew "pre-commit"
cask "fork"

# Version Management
brew "goenv"
brew "pyenv"
brew "nodebrew"
brew "nodenv"
brew "rbenv"

# Languages & Runtimes
brew "go"
brew "uv"
brew "yarn"

# Infrastructure
brew "awscli"
brew "saml2aws"
cask "google-cloud-sdk"
cask "tailscale-app"

# Docker
cask "docker-desktop"

# Database
brew "mysql"

# CLI Tools
brew "bat"
brew "direnv"
brew "fzf"
brew "wget"
brew "mas"

# Security
brew "gnupg"
brew "pinentry-mac"
brew "ykman"
brew "opensc"
brew "hidapi"
cask "1password"
cask "1password-cli"

# Applications
cask "appcleaner"
cask "clipy"
cask "deepl"
cask "discord"
cask "evernote"
cask "goland"
cask "google-chrome"
cask "google-drive"
cask "meld"
cask "slack"
cask "the-unarchiver"

# Android
cask "android-studio"
cask "android-commandlinetools"

# Fonts
cask "font-monaspace"
