tap "homebrew/bundle"
tap "caskroom/cask"

brew "go"
brew "goenv"
brew "nodebrew"
brew "ruby"
brew "git"
brew "gibo"
brew "python3"
brew "vim"
brew "zsh"
brew "docker"
brew "docker-compose"

cask "appcleaner"
cask "google-japanese-ime"
cask "the-unarchiver"
cask "clipy"
cask "google-chrome"
cask "visual-studio-code"
cask "fork"
cask "docker"
cask "slack"
