tap 'homebrew/bundle'
brew 'go', args: ['cross-compile-common']
brew "goenv"
brew 'git'
brew "gibo"
brew "tig"
brew 'tmux'
brew 'nodebrew'
brew 'python3'
brew 'vim', args: ['with-lua', 'with-luajit', 'with-python3']
brew 'zsh', args: ['disable-etcdir']
brew 'zsh-completions'
brew 'neovim'

tap 'caskroom/cask'
cask '1password'
cask 'appcleaner'
cask 'google-japanese-ime'
cask 'the-unarchiver'
cask 'vagrant'
cask 'virtualbox'
cask 'clipy'
cask 'chrome'
