tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "awscli"
brew "docker"
brew "docker-compose"
brew "gibo"
brew "git"
brew "gnupg"
brew "go"
brew "goenv"
brew "mas"
brew "nodebrew"
brew "opensc"
brew "pinentry-mac"
brew "pyenv"
brew "python"
brew "ruby"
brew "vim"
brew "wget"
brew "ykman"
brew "zsh"
cask "1password"
cask "appcleaner"
cask "clipy"
cask "discord"
cask "docker"
cask "evernote"
cask "fork"
cask "goland"
cask "google-chrome"
cask "google-cloud-sdk"
cask "slack"
cask "sublime-text"
cask "the-unarchiver"
cask "visual-studio-code"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
